; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image3 - mode
	spectrograph0 - mode
	infrared1 - mode
	infrared2 - mode
	GroundStation3 - direction
	Star1 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument3 infrared1)
	(supports instrument3 image3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(pointing satellite1 Star5)
	(pointing satellite2 GroundStation2)
	(have_image Star5 infrared2)
	(have_image Star6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Phenomenon8 infrared2)
	(have_image Planet9 image3)
	(have_image Star10 infrared1)
	(have_image Planet11 infrared1)
	(have_image Star12 infrared2)
	(have_image Planet13 spectrograph0)
))

)

; plan
1. (turn_to satellite2 star0 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star0)
   goals met: 0 of 11
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite2 planet9 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet9)
   goals met: 0 of 11
5. (take_image satellite2 planet9 instrument3 image3)
   added: (have_image planet9 image3)
   goals met: 1 of 11
6. (turn_to satellite2 planet13 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet13)
   goals met: 1 of 11
7. (take_image satellite2 planet13 instrument3 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 2 of 11
8. (turn_to satellite2 planet11 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet11)
   goals met: 2 of 11
9. (take_image satellite2 planet11 instrument3 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 3 of 11
10. (turn_to satellite2 phenomenon7 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon7)
   goals met: 3 of 11
11. (turn_to satellite1 groundstation2 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation2)
   goals met: 3 of 11
12. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 11
13. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 3 of 11
14. (take_image satellite2 phenomenon7 instrument3 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 4 of 11
15. (turn_to satellite1 phenomenon8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 11
16. (take_image satellite1 phenomenon8 instrument1 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 5 of 11
17. (turn_to satellite1 star12 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star12)
   goals met: 5 of 11
18. (take_image satellite1 star12 instrument1 infrared2)
   added: (have_image star12 infrared2)
   goals met: 6 of 11
19. (turn_to satellite1 star5 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star5)
   goals met: 7 of 11
20. (take_image satellite1 star5 instrument1 infrared2)
   added: (have_image star5 infrared2)
   goals met: 8 of 11
21. (turn_to satellite2 star10 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star10)
   goals met: 8 of 11
22. (take_image satellite2 star10 instrument3 infrared1)
   added: (have_image star10 infrared1)
   goals met: 9 of 11
23. (turn_to satellite2 star6 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star6)
   goals met: 9 of 11
24. (take_image satellite2 star6 instrument3 infrared1)
   added: (have_image star6 infrared1)
   goals met: 10 of 11
25. (turn_to satellite2 groundstation2 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation2)
   goals met: 11 of 11
